{"<PAD>": 0, "<UNK>": 1, "i": 2, "me": 3, "spending": 4, "can": 5, "how": 6, "this": 7, "month": 8, "my": 9, "money": 10, "to": 11, "today": 12, "you": 13, "now": 14, "please": 15, "budget": 16, "quickly": 17, "much": 18, "tell": 19, "for": 20, "what": 21, "expenses": 22, "know": 23, "total": 24, "coach": 25, "show": 26, "savings": 27, "check": 28, "is": 29, "out": 30, "NUM": 31, "cost": 32, "am": 33, "spend": 34, "right": 35, "buddy": 36, "a": 37, "expense": 38, "financial": 39, "on": 40, "daily": 41, "hey": 42, "thanks": 43, "help": 44, "day": 45, "okay": 46, "food": 47, "was": 48, "balance": 49, "with": 50, "spent": 51, "income": 52, "vs": 53, "of": 54, "figure": 55, "want": 56, "wondering": 57, "the": 58, "let": 59, "could": 60, "about": 61, "week": 62, "just": 63, "do": 64, "cash": 65, "in": 66, "where": 67, "afford": 68, "all": 69, "buy": 70, "will": 71, "did": 72, "purchase": 73, "account": 74, "more": 75, "tips": 76, "count": 77, "per": 78, "summary": 79, "save": 80, "status": 81, "shopping": 82, "average": 83, "weekly": 84, "should": 85, "rate": 86, "enough": 87, "or": 88, "saving": 89, "s": 90, "amount": 91, "compare": 92, "end": 93, "transport": 94, "at": 95, "number": 96, "report": 97, "going": 98, "funds": 99, "whats": 100, "received": 101, "biggest": 102, "last": 103, "have": 104, "overview": 105, "many": 106, "category": 107, "it": 108, "bank": 109, "most": 110, "transactions": 111, "health": 112, "salary": 113, "hi": 114, "bill": 115, "monthly": 116, "get": 117, "finances": 118, "comparison": 119, "within": 120, "accounts": 121, "breakdown": 122, "good": 123, "any": 124, "go": 125, "current": 126, "bills": 127, "which": 128, "hello": 129, "transaction": 130, "payment": 131, "over": 132, "new": 133, "outflow": 134, "limit": 135, "and": 136, "eating": 137, "entertainment": 138, "better": 139, "damage": 140, "groceries": 141, "highest": 142, "morning": 143, "progress": 144, "room": 145, "give": 146, "forecast": 147, "one": 148, "be": 149, "used": 150, "date": 151, "review": 152, "financially": 153, "wallet": 154, "entries": 155, "advice": 156, "quick": 157, "payments": 158, "days": 159, "by": 160, "largest": 161, "left": 162, "expensive": 163, "trend": 164, "from": 165, "draining": 166, "remaining": 167, "year": 168, "pay": 169, "pace": 170, "far": 171, "fast": 172, "keeps": 173, "there": 174, "so": 175, "picture": 176, "display": 177, "doing": 178, "track": 179, "projected": 180, "full": 181, "todays": 182, "everything": 183, "time": 184, "up": 185, "costs": 186, "safe": 187, "snapshot": 188, "side": 189, "splurge": 190, "too": 191, "available": 192, "net": 193, "does": 194, "lowest": 195, "earned": 196, "grade": 197, "fund": 198, "gone": 199, "wise": 200, "burn": 201, "allowance": 202, "each": 203, "single": 204, "rupees": 205, "handle": 206, "top": 207, "saved": 208, "evening": 209, "smart": 210, "phone": 211, "card": 212, "earnings": 213, "anything": 214, "bought": 215, "dining": 216, "overspending": 217, "area": 218, "times": 219, "afternoon": 220, "rent": 221, "allocation": 222, "sum": 223, "situation": 224, "earning": 225, "limits": 226, "update": 227, "recharge": 228, "dough": 229, "cap": 230, "gift": 231, "pull": 232, "went": 233, "analysis": 234, "versus": 235, "emergency": 236, "drain": 237, "prediction": 238, "debits": 239, "purchases": 240, "moolah": 241, "away": 242, "uber": 243, "compared": 244, "hurt": 245, "break": 246, "down": 247, "overall": 248, "fees": 249, "inflow": 250, "against": 251, "paid": 252, "max": 253, "hand": 254, "across": 255, "months": 256, "than": 257, "being": 258, "expenditure": 259, "smallest": 260, "frequency": 261, "categories": 262, "exceeded": 263, "percentage": 264, "thing": 265, "record": 266, "buying": 267, "take": 268, "range": 269, "consumption": 270, "sources": 271, "improvement": 272, "like": 273, "improve": 274, "bucks": 275, "are": 276, "worth": 277, "swiggy": 278, "teach": 279, "restaurants": 280, "overspend": 281, "frugal": 282, "blowing": 283, "cheapest": 284, "least": 285, "volume": 286, "finance": 287, "view": 288, "chat": 289, "laptop": 290, "blow": 291, "emi": 292, "checkup": 293, "credit": 294, "eats": 295, "red": 296, "flags": 297, "credited": 298, "coming": 299, "primary": 300, "stats": 301, "estimated": 302, "recap": 303, "management": 304, "rundown": 305, "trip": 306, "wages": 307, "incoming": 308, "habits": 309, "usage": 310, "outgoing": 311, "bot": 312, "travel": 313, "trajectory": 314, "score": 315, "goes": 316, "projection": 317, "vacation": 318, "would": 319, "discipline": 320, "start": 321, "loaded": 322, "following": 323, "crossed": 324, "into": 325, "goal": 326, "cumulative": 327, "treat": 328, "car": 329, "clothes": 330, "not": 331, "balances": 332, "fuel": 333, "coffee": 334, "pet": 335, "costing": 336, "pit": 337, "essential": 338, "percent": 339, "freelance": 340, "vanishing": 341, "typical": 342, "numbers": 343, "headed": 344, "monday": 345, "performance": 346, "debt": 347, "night": 348, "myself": 349, "make": 350, "trigger": 351, "gym": 352, "combined": 353, "analyze": 354, "half": 355, "keeping": 356, "through": 357, "extrapolate": 358, "likely": 359, "find": 360, "stand": 361, "course": 362, "zomato": 363, "ola": 364, "february": 365, "off": 366, "first": 367, "less": 368, "non": 369, "budgets": 370, "alert": 371, "warning": 372, "disciplined": 373, "growth": 374, "safety": 375, "outlook": 376, "extremes": 377, "seven": 378, "events": 379, "swipes": 380, "careful": 381, "wealth": 382, "wellness": 383, "flowing": 384, "manage": 385, "something": 386, "subscription": 387, "gadget": 388, "list": 389, "amazon": 390, "online": 391, "flipkart": 392, "head": 393, "needs": 394, "keep": 395, "disappearing": 396, "stop": 397, "running": 398, "estimate": 399, "deep": 400, "minimum": 401, "once": 402, "high": 403, "cut": 404, "glance": 405, "open": 406, "lets": 407, "advisor": 408, "item": 409, "position": 410, "standing": 411, "holdings": 412, "cab": 413, "grocery": 414, "insurance": 415, "previous": 416, "weekday": 417, "wants": 418, "wasting": 419, "distribution": 420, "problem": 421, "costliest": 422, "predict": 423, "anticipated": 424, "complete": 425, "activity": 426, "entry": 427, "personal": 428, "hacks": 429, "optimize": 430, "brief": 431, "yo": 432, "guide": 433, "swing": 434, "waste": 435, "look": 436, "gas": 437, "revenue": 438, "everyday": 439, "if": 440, "priciest": 441, "budgeting": 442, "build": 443, "launch": 444, "use": 445, "without": 446, "wedding": 447, "education": 448, "water": 449, "restaurant": 450, "q": 451, "contrast": 452, "target": 453, "audit": 454, "records": 455, "upi": 456, "reduce": 457, "ai": 458, "broke": 459, "watch": 460, "bigger": 461, "close": 462, "sticking": 463, "aside": 464, "cant": 465, "hold": 466, "smaller": 467, "run": 468, "spike": 469, "figures": 470, "suggestions": 471, "coaching": 472, "shoes": 473, "auto": 474, "tight": 475, "credits": 476, "rapid": 477, "leaking": 478, "onto": 479, "getting": 480, "till": 481, "methods": 482, "state": 483, "ps": 484, "shell": 485, "comfortably": 486, "able": 487, "goa": 488, "meals": 489, "freely": 490, "safely": 491, "k": 492, "between": 493, "higher": 494, "cross": 495, "stay": 496, "history": 497, "passive": 498, "rule": 499, "hit": 500, "losing": 501, "sieve": 502, "survive": 503, "movement": 504, "swipe": 505, "guru": 506, "bear": 507, "tablet": 508, "electronics": 509, "membership": 510, "got": 511, "disposable": 512, "multi": 513, "totals": 514, "dine": 515, "takes": 516, "worst": 517, "other": 518, "difference": 519, "tracker": 520, "adherence": 521, "busted": 522, "signs": 523, "runway": 524, "breathing": 525, "deposited": 526, "rental": 527, "hustle": 528, "after": 529, "tax": 530, "recent": 531, "padded": 532, "holes": 533, "somehow": 534, "since": 535, "frequently": 536, "wisely": 537, "faster": 538, "lessons": 539, "learn": 540, "nice": 541, "meet": 542, "bike": 543, "means": 544, "little": 545, "hdfc": 546, "own": 547, "looking": 548, "banks": 549, "tea": 550, "street": 551, "clothing": 552, "lpg": 553, "cooking": 554, "rickshaw": 555, "haircut": 556, "rides": 557, "march": 558, "april": 559, "offline": 560, "battle": 561, "wins": 562, "best": 563, "them": 564, "under": 565, "utilization": 566, "compliance": 567, "blew": 568, "blown": 569, "earn": 570, "bonus": 571, "came": 572, "home": 573, "source": 574, "secondary": 575, "saver": 576, "retained": 577, "bleeding": 578, "hemorrhaging": 579, "slipping": 580, "shrinking": 581, "median": 582, "an": 583, "burned": 584, "place": 585, "low": 586, "often": 587, "incomes": 588, "cutting": 589, "lower": 590, "ways": 591, "building": 592, "been": 593, "acquire": 594, "spree": 595, "invest": 596, "rich": 597, "pocket": 598, "leftover": 599, "internet": 600, "breakfast": 601, "lunch": 602, "tech": 603, "mobile": 604, "premium": 605, "tuition": 606, "lab": 607, "test": 608, "laundry": 609, "weekend": 610, "bottom": 611, "second": 612, "worse": 613, "warnings": 614, "breach": 615, "alerts": 616, "flexibility": 617, "slack": 618, "latest": 619, "benchmark": 620, "fraction": 621, "stash": 622, "potential": 623, "leak": 624, "major": 625, "flow": 626, "pouring": 627, "center": 628, "main": 629, "heaviest": 630, "dropping": 631, "usual": 632, "standard": 633, "mean": 634, "regular": 635, "expected": 636, "speed": 637, "future": 638, "aggregate": 639, "grand": 640, "debited": 641, "ranked": 642, "min": 643, "outlier": 644, "rolling": 645, "living": 646, "decisions": 647, "reduction": 648, "sup": 649, "hola": 650, "greetings": 651, "ready": 652, "heyy": 653, "talk": 654, "genius": 655, "pick": 656, "upgrade": 657, "affordable": 658, "justify": 659, "capacity": 660, "fine": 661, "see": 662, "liquid": 663, "sbi": 664, "free": 665, "unspent": 666, "movie": 667, "pharmacy": 668, "electricity": 669, "cafe": 670, "shoe": 671, "dth": 672, "train": 673, "ticket": 674, "service": 675, "doctor": 676, "visit": 677, "dental": 678, "eye": 679, "beauty": 680, "cleaning": 681, "installment": 682, "donation": 683, "detail": 684, "face": 685, "rank": 686, "improved": 687, "necessities": 688, "luxuries": 689, "runs": 690, "until": 691, "controlled": 692, "details": 693, "deposits": 694, "investment": 695, "interest": 696, "contract": 697, "reimbursement": 698, "refund": 699, "cashback": 700, "rewards": 701, "gross": 702, "ideal": 703, "cushion": 704, "frugality": 705, "thrifty": 706, "deficit": 707, "kept": 708, "ratio": 709, "recommendation": 710, "rainy": 711, "fitness": 712, "pie": 713, "chart": 714, "burning": 715, "issue": 716, "throwing": 717, "dominant": 718, "majority": 719, "leaving": 720, "footprint": 721, "operating": 722, "routine": 723, "withdrawals": 724, "costly": 725, "tiniest": 726, "unusual": 727, "happened": 728, "ongoing": 729, "wtd": 730, "instances": 731, "made": 732, "digital": 733, "recommend": 734, "plan": 735, "techniques": 736, "mindful": 737, "conscious": 738, "choices": 739, "boost": 740, "increase": 741, "grow": 742, "general": 743, "level": 744, "diagnose": 745, "assess": 746, "evaluate": 747, "howdy": 748, "namaste": 749, "begin": 750, "assistant": 751, "wake": 752, "hellooo": 753, "heyyy": 754, "hii": 755, "assist": 756, "pal": 757, "feasibility": 758, "reveal": 759, "present": 760, "verify": 761, "icici": 762, "petrol": 763, "medical": 764, "snack": 765, "dinner": 766, "fashion": 767, "accessory": 768, "metro": 769, "flight": 770, "parking": 771, "charges": 772, "maintenance": 773, "lic": 774, "school": 775, "book": 776, "stationery": 777, "medicine": 778, "hospital": 779, "loan": 780, "charity": 781, "vet": 782, "two": 783, "january": 784, "compensation": 785, "dividend": 786, "gig": 787, "client": 788, "positive": 789, "negative": 790, "efficiency": 791, "optimal": 792, "heading": 793, "unnecessary": 794, "pattern": 795, "bulk": 796, "dissect": 797, "always": 798, "normal": 799, "diem": 800, "direction": 801, "outcome": 802, "project": 803, "forward": 804, "ahead": 805, "entire": 806, "ytd": 807, "annual": 808, "maximum": 809, "peak": 810, "outgoings": 811, "workweek": 812, "business": 813, "trailing": 814, "strategies": 815, "educate": 816, "big": 817, "detailed": 818, "consolidated": 819, "assessment": 820, "affairs": 821, "placed": 822, "oi": 823, "again": 824, "bonjour": 825, "grab": 826, "feasible": 827, "power": 828, "assets": 829, "uncommitted": 830, "wifi": 831, "bus": 832, "fare": 833, "toll": 834, "vehicle": 835, "household": 836, "items": 837, "change": 838, "examine": 839, "leaks": 840, "resources": 841, "behavior": 842, "overhead": 843, "continues": 844, "yearly": 845, "micro": 846, "past": 847, "work": 848, "statistics": 849, "planning": 850, "dashboard": 851, "comprehensive": 852, "order": 853, "utility": 854, "salon": 855, "mooney": 856, "cover": 857, "cst": 858, "commute": 859, "put": 860, "mony": 861, "cot": 862, "expensse": 863, "set": 864, "retain": 865, "tis": 866, "tday": 867, "howw": 868, "cna": 869, "moving": 870, "hsow": 871, "moey": 872, "sending": 873, "nicome": 874, "monht": 875, "budet": 876, "bugdet": 877, "tootal": 878, "savins": 879, "todaay": 880, "caan": 881, "ccan": 882, "wihtin": 883, "ffor": 884, "ttal": 885, "mucch": 886, "hte": 887, "spenidng": 888, "exppenses": 889, "exenses": 890, "spedning": 891, "spening": 892, "exxpense": 893, "coost": 894, "weeek": 895, "higehst": 896, "sppending": 897, "spendign": 898, "incoem": 899, "ech": 900, "budegt": 901, "nay": 902, "budgte": 903, "ths": 904, "buudget": 905, "buget": 906, "mnth": 907, "totla": 908, "omney": 909, "inome": 910, "savig": 911, "savinsg": 912, "chck": 913, "ssaved": 914, "expeses": 915, "speending": 916, "mney": 917, "spendig": 918, "tpo": 919, "spendiing": 920, "spendding": 921, "exepnse": 922, "whta": 923, "dailly": 924, "ady": 925, "fiinancial": 926, "ttoal": 927, "spneding": 928, "htis": 929, "epense": 930, "tody": 931, "hwo": 932, "updatee": 933, "wweek": 934, "tisp": 935, "summry": 936, "finanical": 937, "statte": 938}